Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: One way to do it is to templatize your code that needs to use a packet stream.
it_it: Un modo per farlo è creare un template del codice che deve utilizzare lo stream di packet.

source: One way to do this is to define a global variable like this:
it_it: Un modo per farlo è definire una variabile globale come questa:

source: One way to express the DAG is to use the After clause of EXPECT_CALL.
it_it: Un modo per esprimere il DAG è utilizzare la clausola After di EXPECT_CALL.

source: One way to express the DAG is to use the [`After` clause](reference/mocking.md#EXPECT_CALL.After) of `EXPECT_CALL`.
it_it: Un modo per esprimere il DAG è utilizzare la [clausola `After`](reference/mocking.md#EXPECT_CALL.After) di `EXPECT_CALL`.

source: Only failures in the current thread are checked to determine the result of this type of expectations.
it_it: Vengono controllati solo gli errori nel thread corrente per determinare il risultato di questo tipo di aspettative.

source: Only failures in the thread that executes the assertion are checked to determine the result of this type of assertions.
it_it: Vengono controllati solo gli errori nel thread che esegue l'asserzione per determinare il risultato di questo tipo di asserzioni.

source: Only the tests that match the filter will run.
it_it: Verranno eseguiti solo i test che corrispondono al filtro.

source: Only the *author of the base class* knows the protocol, and we cannot look into his or her head.
it_it: Solo l'*autore della classe base* conosce il protocollo e non possiamo guardargli nella testa.

source: Only the author of the base class knows the protocol, and we cannot look into his or her head.
it_it: Solo l'autore della classe base conosce il protocollo e non possiamo guardargli nella testa.

source: Only the last value for a given key is logged.
it_it: Viene loggato solo l'ultimo valore per una determinata chiave.

source: Only the return value of the last action in the sequence will be used.
it_it: Verrà utilizzato solo il valore restituito dell'ultima azione nella sequenza.

source: Optionally, set the default actions of the mock objects.
it_it: Facoltativamente, imposta le azioni di default degli oggetti mock.

source: Optionally, verify and reset the mock.
it_it: Facoltativamente, verificare e reimpostare il mock.

source: Optionally, you can stream additional information to a hidden argument named result_listener to explain the match result.
it_it: Facoltativamente, si possono trasmettere informazioni aggiuntive a un argomento nascosto denominato result_listener per spiegare il risultato della corrispondenza [match].

source: Optionally, you can stream additional information to a hidden argument named `result_listener` to explain the match result.
it_it: Facoltativamente, si possono trasmettere informazioni aggiuntive a un argomento nascosto denominato `result_listener` per spiegare il risultato della corrispondenza [match].

source: Options for the Google C++ Testing Framework
it_it: Opzioni per il Google C++ Testing Framework

source: Or perhaps your interface is taking on too many roles and should be split up.
it_it: Oppure probabilmente l'interfaccia sta assumendo troppi ruoli e dovrebbe essere suddivisa.

source: Or (in the case of ASSERT_DEATH and EXPECT_DEATH) is the exit status non-zero?
it_it: Oppure (nel caso di ASSERT_DEATH e di EXPECT_DEATH) lo stato di uscita è diverso da zero?

source: Or (in the case of `ASSERT_DEATH` and `EXPECT_DEATH`) is the exit status non-zero?
it_it: Oppure (nel caso di `ASSERT_DEATH` e di `EXPECT_DEATH`) lo stato di uscita è diverso da zero?

source: Or a struct with a call operator (even a templated one):
it_it: O una struct con un operatore di chiamata (anche uno basato su template):

source: Or is the code under test doing something wrong?
it_it: Oppure il codice sotto test sta facendo qualcosa di sbagliato?

source: Or, you can declare an individual test as a friend of your class by adding this line in the class body:
it_it: Oppure si può dichiarare un test individuale come friend della classe aggiungendo questa riga nel corpo della classe:

source: Or, you can just type `C-x`` to jump to the next error.
it_it: Oppure si può semplicemente digitare `C-x` per passare all'errore successivo.

source: Or, you may be able to get away from it if you can guarantee that bar won't be changed after the EXPECT_CALL() is executed.
it_it: Oppure si potrebbe riuscire a evitarlo se se si garantisce che la bar non verrà modificata dopo l'esecuzione di EXPECT_CALL().

source: Or, you may be able to get away from it if you can guarantee that `bar` won't be changed after the `EXPECT_CALL()` is executed.
it_it: Oppure si potrebbe riuscire a evitarlo se se si garantisce che la `bar` non verrà modificata dopo l'esecuzione di `EXPECT_CALL()`.

source: Or, you may have defined several types that are supposed to conform to the same "concept" and you want to verify it.
it_it: Oppure si potrebbero aver definito diversi tipi che dovrebbero essere conformi allo stesso "concetto" e si desidera verificarlo.

source: Or, you might be trying to solve the wrong problem.
it_it: Oppure si sta cercando di risolvere il problema sbagliato.

source: Ordered vs Unordered Calls {#OrderedCalls}
it_it: Chiamate ordinate e Non {#OrderedCalls}

source: Other values are info and warning.
it_it: Altri valori sono info e warning.

source: Other values are `info` and `warning`.
it_it: Altri valori sono `info` e `warning`.

source: Other values for the variable are illegal and will cause the death test to fail.
it_it: Altri valori per la variabile sono illegali e causeranno il fallimento del death test.

source: Otherwise Bad Things will happen.
it_it: Altrimenti Accadranno Cose Brutte.

source: Otherwise the signature of DoAll would not match the signature expected by WillOnce, which is the signature of the mocked method, and it wouldn't compile.
it_it: Altrimenti la firma [signature] di DoAll non corrisponderebbe a quella prevista da WillOnce, che è la firma del metodo mock-ato, e non verrebbe compilato.

source: Otherwise the compiler will think that each comma in the type list introduces a new macro argument.
it_it: Altrimenti il compilatore penserà che ogni virgola nell'elenco dei tipi introduca un nuovo argomento della macro.

source: Otherwise the signature of `DoAll` would not match the signature expected by `WillOnce`, which is the signature of the mocked method, and it wouldn't compile.
it_it: Altrimenti la firma [signature] di `DoAll` non corrisponderebbe a quella prevista da `WillOnce`, che è la firma del metodo mock-ato, e non verrebbe compilato.

source: Otherwise your code is **invalid C++**, and may break in unexpected ways.
it_it: Altrimenti il codice sarà **C++ invalido**, e potrebbe 'rompersi' in modi imprevisti.

source: Otherwise your code is invalid C++, and may break in unexpected ways.
it_it: Altrimenti il codice sarà C++ invalido, e potrebbe 'rompersi' in modi imprevisti.

source: Otherwise, GoogleTest will attempt to print them in the best way it can—see Teaching GoogleTest How to Print Your Values.
it_it: Altrimenti, GoogleTest tenterà di stamparli nel miglior modo possibile: vedere Insegnare a GoogleTest Come Stampare i Propri Valori.

source: Otherwise, GoogleTest will attempt to print them in the best way it can—see [Teaching GoogleTest How to Print Your Values](../advanced.md#teaching-googletest-how-to-print-your-values).
it_it: Altrimenti, GoogleTest tenterà di stamparli nel miglior modo possibile: vedere [Insegnare a GoogleTest Come Stampare i Propri Valori](../advanced.md#teaching-googletest-how-to-print-your-values).

source: Otherwise, for POSIX systems (Linux, Cygwin, Mac), GoogleTest uses the POSIX extended regular expression syntax.
it_it: Altrimenti, per i sistemi POSIX (Linux, Cygwin, Mac), GoogleTest utilizza la sintassi POSIX extended regular expression.

source: Otherwise, for POSIX systems (Linux, Cygwin, Mac), GoogleTest uses the [POSIX extended regular expression](https://www.opengroup.org/onlinepubs/009695399/basedefs/xbd_chap09.html#tag_09_04) syntax.
it_it: Altrimenti, per i sistemi POSIX (Linux, Cygwin, Mac), GoogleTest utilizza la sintassi [POSIX extended regular expression](https://www.opengroup.org/onlinepubs/009695399/basedefs/xbd_chap09.html#tag_09_04).

source: Otherwise, it succeeds.
it_it: Altrimenti, è riuscito.

source: Otherwise, verifies nothing.
it_it: Altrimenti, non verifica nulla.

source: Otherwise, when the owner of Foo changes it, your test could break.
it_it: Altrimenti, quando il proprietario di Foo la modifica, il test potrebbe non funzionare.

source: Otherwise, when the owner of `Foo` changes it, your test could break.
it_it: Altrimenti, quando il proprietario di `Foo` la modifica, il test potrebbe non funzionare.

source: Our general recommendation is to use nice mocks (not yet the default) most of the time, use naggy mocks (the current default) when developing or debugging tests, and use strict mocks only as the last resort.
it_it: La nostra raccomandazione generale è quella di utilizzare mock "nice" (non ancora il default) per la maggior parte del tempo, usare mock "naggy" (l'attuale default) durante lo sviluppo o il debug dei test e usare mock "strict" solo come ultima risorsa.

source: Output from running the square root test
it_it: L'output dell'esecuzione del test della radice quadrata

source: Outside your test fixture class (typically just below it), define those member variables, optionally giving them initial values.
it_it: All'esterno della classe fixture (in genere appena sotto di essa), si definiscono tali variabili membro, facoltativamente dando loro valori iniziali.

source: Over specification leads to brittle tests and obscures the intent of tests.
it_it: Una specifica eccessiva porta a test fragili e oscura l'intento dei test.

source: Override this to define how to set up the environment.
it_it: Si crea l'override di questo per definire come configurare l'ambiente.

source: Override this to define how to tear down the environment.
it_it: Si crea l'override di questo per definire come eseguire il [tear down] dell'environment.

source: Override this to perform test fixture setup.
it_it: Si crea l'override di questo per eseguire il setup della fixture.

source: Override this to perform test fixture teardown.
it_it: Si crea l'override di questo per eseguire il teardown della fixture.

source: Parameter Generator
it_it: Generatore di Parametri

source: Parameterized Test example
it_it: Esempio di Test Parametrizzato

source: Parameterized Test example with multiple parameters
it_it: Esempio di Test Parametrizzato con più parametri

source: Pass the N-th (0-based) argument of the mock function to action a and perform it.
it_it: Passa l'argomento N-esimo (in base 0) della funzione mock all'azione a e la esegue.

source: Pass the `N`-th (0-based) argument of the mock function to action `a` and perform it.
it_it: Passa l'argomento `N`-esimo (in base 0) della funzione mock all'azione `a` e la esegue.

source: Pass the selected (0-based) arguments of the mock function to action a and perform it.
it_it: Passa gli argomenti selezionati (a base 0) della funzione mock all'azione a e la esegue.

source: Pass the selected (0-based) arguments of the mock function to action `a` and perform it.
it_it: Passa gli argomenti selezionati (a base 0) della funzione mock all'azione `a` e la esegue.

source: Pay special attention when your class is defined in a namespace.
it_it: Prestare particolare attenzione quando la classe è definita in un namespace.

source: Perform action a and ignore its result.
it_it: Esegui l'azione a e ne ignora il risultato.

source: Perform action a without any arguments.
it_it: Esegue l'azione a senza argomenti.

source: Perform action `a` and ignore its result.
it_it: Esegui l'azione `a` e ne ignora il risultato.

source: Perform action `a` without any arguments.
it_it: Esegue l'azione `a` senza argomenti.

source: Performing Different Actions Based on the Arguments
it_it: Eseguire Azioni Diverse in Base agli Argomenti

source: Performs shared setup for all tests in the test suite.
it_it: Esegue la configurazione condivisa [shared] per tutti i test nella test suite.

source: Performs shared teardown for all tests in the test suite.
it_it: Esegue il teardown condiviso [shared] per tutti i test della test suite.

source: Perhaps it will fail only 1% of the time, making it rather hard to reproduce the bug under a debugger.
it_it: Forse fallirà solo l'1% delle volte, rendendo piuttosto difficile riprodurre il bug in un debugger.

source: Perhaps you haven't got used to the interaction-based way of testing yet.
it_it: Forse non si è ancora abituati al metodo di test basato sull'interazione [interaction-based].

source: Perhaps you want to do it as part of a stub action, or perhaps your test doesn't need to mock Concrete() at all (but it would be oh-so painful to have to define a new mock class whenever you don't need to mock one of its methods).
it_it: Probabilmente come parte di un'azione stub, o forse il test non ha bisogno del mock di Concrete() (ma sarebbe davvero tedioso dover definire una nuova classe mock ogni volta che non è necessario il mock di uno dei suoi metodi).

source: Perhaps you want to do it as part of a stub action, or perhaps your test doesn't need to mock `Concrete()` at all (but it would be oh-so painful to have to define a new mock class whenever you don't need to mock one of its methods).
it_it: Probabilmente come parte di un'azione stub, o forse il test non ha bisogno del mock di `Concrete()` (ma sarebbe davvero tedioso dover definire una nuova classe mock ogni volta che non è necessario il mock di uno dei suoi metodi).

source: Pkg-config can be used in a cross-compilation setting too.
it_it: Pkg-config è utilizzabile anche in un ambiente di cross-compilazione.

source: Pkg-config is a standardised plain-text format containing
it_it: Pkg-config è un semplice formato di testo standardizzato contenente

source: Please note that INSTANTIATE_TEST_SUITE_P will instantiate all tests in the given test suite, whether their definitions come before or after the INSTANTIATE_TEST_SUITE_P statement.
it_it: Si noti che INSTANTIATE_TEST_SUITE_P istanzia tutti i test nella test suite, indipendentemente dal fatto che le loro definizioni vengano prima o dopo la dichiarazione INSTANTIATE_TEST_SUITE_P.

source: Please note that `INSTANTIATE_TEST_SUITE_P` will instantiate *all* tests in the given test suite, whether their definitions come before or *after* the `INSTANTIATE_TEST_SUITE_P` statement.
it_it: Si noti che `INSTANTIATE_TEST_SUITE_P` istanzia *tutti* i test nella test suite, indipendentemente dal fatto che le loro definizioni vengano prima o *dopo* la dichiarazione `INSTANTIATE_TEST_SUITE_P`.

source: Please note that changing the default value for a type can make your tests hard to understand.
it_it: Notare che la modifica del valore di default per un tipo può rendere difficile la comprensione dei test.

source: Please note that once you expressed interest in a particular mock method (via EXPECT_CALL()), all invocations to it must match some expectation.
it_it: Si tenga presente che una volta espresso interesse per un particolare metodo mock (tramite EXPECT_CALL()), tutte le invocazioni ad esso devono corrispondere a qualche expectation.

source: Please note that once you expressed interest in a particular mock method (via `EXPECT_CALL()`), all invocations to it must match some expectation.
it_it: Si tenga presente che una volta espresso interesse per un particolare metodo mock (tramite `EXPECT_CALL()`), tutte le invocazioni ad esso devono corrispondere a qualche expectation.

source: Please note that the custom description string is for a particular *instance* of the matcher, where the parameters have been bound to actual values.
it_it: Notare che la stringa di descrizione personalizzata è per una particolare *istanza* del matcher, in cui i parametri sono stati associati a valori effettivi.

source: Please note that the custom description string is for a particular instance of the matcher, where the parameters have been bound to actual values.
it_it: Notare che la stringa di descrizione personalizzata è per una particolare istanza del matcher, in cui i parametri sono stati associati a valori effettivi.

source: Please see more details here.
it_it: Consultare ulteriori dettagli qui.

source: Please see more details [here](advanced.md#assertion-placement).
it_it: Consultare ulteriori dettagli [qui](advanced.md#assertion-placement).

source: Pointer Matchers
it_it: Matcher di Puntatori

source: Practice is a much better way to grasp the subtle differences between the two tools.
it_it: La pratica è un modo molto migliore per cogliere le sottili differenze tra i due strumenti.

source: Pre-defined Symbol
it_it: Simbolo Pre-definito

source: Predicate Assertions for Better Error Messages
it_it: Asserzioni di Predicati per del Migliori Messaggi di Errore

source: Predicate Assertions {#predicates}
it_it: Asserzioni sui Predicati {#predicates}

source: Prerequisites
it_it: Prerequisiti

source: Prevents further test execution at runtime.
it_it: Impedisce l'esecuzione di ulteriori test a runtime.

source: Printing the LOG messages generated by the statement inside EXPECT_DEATH() makes it harder to search for real problems in the parent's log.
it_it: Stampare i messaggi di LOG generati dall'istruzione all'interno di EXPECT_DEATH() rende più difficile la ricerca di problemi reali nel log del genitore.

source: Printing the LOG messages generated by the statement inside `EXPECT_DEATH()` makes it harder to search for real problems in the parent's log.
it_it: Stampare i messaggi di LOG generati dall'istruzione all'interno di `EXPECT_DEATH()` rende più difficile la ricerca di problemi reali nel log del genitore.

source: Prints any value x using GoogleTest's value printer.
it_it: Stampa qualsiasi valore x utilizzando la stampante di valori di GoogleTest.

source: Prints any value `x` using GoogleTest's value printer.
it_it: Stampa qualsiasi valore `x` utilizzando la stampante di valori di GoogleTest.

source: Private class members are only accessible from within the class or by friends.
it_it: I membri della classe privata sono accessibili solo dall'interno della classe o dai friend.

source: Private or protected class members
it_it: I membri di classe privati o protetti

source: Propagating Fatal Failures
it_it: Propagazione degli Errori Fatali

source: Properties recorded from a fixture's SetUpTestSuite or TearDownTestSuite methods are logged as attributes of the corresponding <testsuite> element.
it_it: Le proprietà registrate dai metodi SetUpTestSuite o TearDownTestSuite della fixture vengono loggate come attributi del corrispondente elemento <testsuite>.

source: Properties recorded from a fixture's `SetUpTestSuite` or `TearDownTestSuite` methods are logged as attributes of the corresponding `<testsuite>` element.
it_it: Le proprietà registrate dai metodi `SetUpTestSuite` o `TearDownTestSuite` della fixture vengono loggate come attributi del corrispondente elemento `<testsuite>`.

source: Protected Methods {#Environment-protected}
it_it: Metodi Protetti {#Environment-protected}

source: Protected Methods {#Test-protected}
it_it: Metodi Protected {#Test-protected}

source: Prototype of the square root function
it_it: Prototipo della funzione radice quadrata

source: Prototypes for death assertions
it_it: Prototipi per death assertion

source: Provides an empty implementation of all methods in the TestEventListener interface, such that a subclass only needs to override the methods it cares about.
it_it: Fornisce un'implementazione vuota di tutti i metodi nell'interfaccia TestEventListener, in modo tale che una sottoclasse debba solo sovrascrivere [override] i metodi che le interessano.

source: Provides an empty implementation of all methods in the [`TestEventListener`](#TestEventListener) interface, such that a subclass only needs to override the methods it cares about.
it_it: Fornisce un'implementazione vuota di tutti i metodi nell'interfaccia [`TestEventListener`](#TestEventListener), in modo tale che una sottoclasse debba solo sovrascrivere [override] i metodi che le interessano.

source: Provides the static methods Set(), SetFactory(), and Clear() to manage the default value:
it_it: Fornisce i metodi statici Set(), SetFactory() e Clear() per gestire il valore di default:

source: Provides the static methods `Set()`, `SetFactory()`, and `Clear()` to manage the default value:
it_it: Fornisce i metodi statici `Set()`, `SetFactory()` e `Clear()` per gestire il valore di default:

source: Providing a custom functor allows for more control over test parameter name generation, especially for types where the automatic conversion does not generate helpful parameter names (e.g. strings as demonstrated above).
it_it: Fornire un funtore personalizzato consente un maggiore controllo sulla generazione dei nomi dei parametri dei test, in particolare per i tipi in cui la conversione automatica non genera nomi utili (ad esempio le stringhe come mostrato sopra).

source: Public Methods {#TestEventListener-public}
it_it: Metodi Pubblici {#TestEventListener-public}

source: Public Methods {#TestEventListeners-public}
it_it: Metodi Pubblici {#TestEventListeners-public}

source: Public Methods {#TestPartResult-public}
it_it: Metodi Pubblici {#TestPartResult-public}

source: Public Methods {#TestProperty-public}
it_it: Metodi Pubblici {#TestProperty-public}

source: Public Methods {#TestResult-public}
it_it: Metodi Pubblici {#TestResult-public}

source: Public Methods {#TestSuite-public}
it_it: Metodi Pubblici {#TestSuite-public}

source: Public Methods {#UnitTest-public}
it_it: Metodi Pubblici {#UnitTest-public}

source: Put another way, the test is interested in the x.Y() method (therefore it explicitly sets some EXPECT_CALL to verify how it's called); however, the verification fails as the test doesn't expect this particular call to happen.
it_it: In altre parole, il test è interessato al metodo x.Y() (quindi imposta esplicitamente alcune EXPECT_CALL per verificare come viene chiamato); tuttavia, la verifica fallisce poiché il test non prevede [expect] che si verifichi questa particolare chiamata.

source: Put another way, the test is interested in the `x.Y()` method (therefore it explicitly sets some `EXPECT_CALL` to verify how it's called); however, the verification fails as the test doesn't expect this particular call to happen.
it_it: In altre parole, il test è interessato al metodo `x.Y()` (quindi imposta esplicitamente alcune `EXPECT_CALL` per verificare come viene chiamato); tuttavia, la verifica fallisce poiché il test non prevede [expect] che si verifichi questa particolare chiamata.

source: Put the TEST_P definitions in foo_param_test.cc, which includes foo_param_test.h.
it_it: Si inseriscono le definizioni TEST_P in foo_param_test.cc, che include foo_param_test.h.

source: Put the `TEST_P` definitions in `foo_param_test.cc`, which includes `foo_param_test.h`.
it_it: Si inseriscono le definizioni `TEST_P` in `foo_param_test.cc`, che include `foo_param_test.h`.

source: Put the definition of the parameterized test fixture class (e.g. FooTest) in a header file, say foo_param_test.h.
it_it: Si inserisce la definizione della classe della fixture parametrizzata (ad esempio FooTest) nel file header, ad esempio foo_param_test.h.

source: Put the definition of the parameterized test fixture class (e.g. `FooTest`) in a header file, say `foo_param_test.h`.
it_it: Si inserisce la definizione della classe della fixture parametrizzata (ad esempio `FooTest`) nel file header, ad esempio `foo_param_test.h`.

source: Qualifier
it_it: Qualificatore
